# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

In [125]:
import pandas as pd
import numpy as np

In [126]:
df_1 = pd.read_csv("data\cleaned_set.csv")
df_2 = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv")
df_3 = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv")

In [127]:
df_1.head(2)

,Unnamed: 0,index,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,0,0,RB50392,Washington,unknown,Master,793690,0,1000,0,Personal Auto,Four-Door Car,2
1,1,1,QZ44356,Arizona,female,Bachelor,697954,0,94,0,Personal Auto,Four-Door Car,1131

In [128]:
df_1 = df_1.drop(columns=["index", "Unnamed: 0"], axis=1)
df_1.head(2)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,unknown,Master,793690,0,1000,0,Personal Auto,Four-Door Car,2
1,QZ44356,Arizona,female,Bachelor,697954,0,94,0,Personal Auto,Four-Door Car,1131

In [129]:
df_2.head(2)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV

In [130]:
# clean column names
df_2 = df_2.rename(columns = {"ST": "State", "GENDER": "Gender"})
df_2.columns = pd.Series(df_2.columns).apply(lambda x: x.lower().replace(' ', '_'))

In [131]:
# clean column "number_of_complaints"
df_2["number_of_open_complaints"] = df_2["number_of_open_complaints"].str.split('/').str[1]
df_2.head(2)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,0,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,0,547.2,Special Auto,SUV

In [132]:
df_3.columns = pd.Series(df_3.columns).apply(lambda x: x.lower().replace(' ', '_'))
df_3.head(2)

,customer,state,customer_lifetime_value,education,gender,income,monthly_premium_auto,number_of_open_complaints,policy_type,total_claim_amount,vehicle_class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car

In [133]:
print("Number of rows of the datasets:")
total_rows = 0
for df in [df_1, df_2, df_3]:
    total_rows += df.shape[0]
    print(df.shape[0])
print("\nTotal number of rows:")
print(total_rows)

Number of rows of the datasets:
1071
996
7070

Total number of rows:
9137

In [134]:
df = pd.concat([df_1, df_2, df_3])

In [135]:
df.shape

(9137, 11)

In [136]:
df.columns

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

In [137]:
df.isna().sum()

customer                     0
state                        0
gender                       5
education                    0
customer_lifetime_value      4
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
policy_type                  0
vehicle_class                0
total_claim_amount           0
dtype: int64

In [138]:
# Clean the column "gender"

df["gender"] = df["gender"].fillna("unknown")
df["gender"] = df["gender"].apply(lambda x: "female" if x in ["F", "Femal", "female"] else ("male" if x in ["M", "Male"] else x))
df["gender"].unique()

array(['unknown', 'female', 'male'], dtype=object)

In [139]:
# Clean the column "customer_lifetime_value"

# delete '%'
df["customer_lifetime_value"] = df["customer_lifetime_value"].str.replace("%", "")

# change type to float
df["customer_lifetime_value"] = df["customer_lifetime_value"].astype(float)

# replace NaN by mean
clv_avg = df["customer_lifetime_value"].mean()
df["customer_lifetime_value"] = df["customer_lifetime_value"].replace({np.nan: clv_avg})
df = df.fillna(clv_avg)

# round the number
df["customer_lifetime_value"] = df["customer_lifetime_value"].round(0).astype(int)

In [140]:
df.isna().sum()

customer                     0
state                        0
gender                       0
education                    0
customer_lifetime_value      0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
policy_type                  0
vehicle_class                0
total_claim_amount           0
dtype: int64

In [141]:
df.head(3)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,unknown,Master,765149,0,1000,0,Personal Auto,Four-Door Car,2.0
1,QZ44356,Arizona,female,Bachelor,765149,0,94,0,Personal Auto,Four-Door Car,1131.0
2,AI49188,Nevada,female,Bachelor,765149,48767,108,0,Personal Auto,Two-Door Car,566.0

In [142]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9137 entries, 0 to 7069
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   9137 non-null   object
 1   state                      9137 non-null   object
 2   gender                     9137 non-null   object
 3   education                  9137 non-null   object
 4   customer_lifetime_value    9137 non-null   int32
 5   income                     9137 non-null   int64
 6   monthly_premium_auto       9137 non-null   int64
 7   number_of_open_complaints  9137 non-null   object
 8   policy_type                9137 non-null   object
 9   vehicle_class              9137 non-null   object
 10  total_claim_amount         9137 non-null   float64
dtypes: float64(1), int32(1), int64(2), object(7)
memory usage: 820.9+ KB

# Challenge 2: Structuring Data

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

In [143]:
# Your code goes here

1. You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).
Round the total revenue to 2 decimal points.  Analyze the resulting table to draw insights.

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

## Bonus

You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month.
Show it in a long format table.

*In data analysis, a long format table is a way of structuring data in which each observation or measurement is stored in a separate row of the table. The key characteristic of a long format table is that each column represents a single variable, and each row represents a single observation of that variable.*

*More information about long and wide format tables here: https://www.statology.org/long-vs-wide-data/*

In [144]:
# Your code goes here